# Database-like operations

In [1]:
# !pip install numpy
# !pip install pandas

In [2]:
import numpy as np
import pandas as pd

## Concatenate

In this example, we take three DataFrames with similar column names and concatenate them using the concat() function.

In [3]:
df1 = pd.DataFrame({'A':[0,1,2],'B':[0,1,2],'C':[0,1,2]},index=[0,1,2])
df1

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2

In [4]:
df2 = pd.DataFrame({'A':[3,4,5,6],'B':[3,4,5,6],'C':[3,4,5,6]},index=[3,4,5,6])
df2

   A  B  C
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6

In [5]:
df3 = pd.DataFrame({'A':[7,8,9],'B':[7,8,9],'C':[7,8,9]},index=[7,8,9])
df3

   A  B  C
7  7  7  7
8  8  8  8
9  9  9  9

In [6]:
frames = [df1, df2, df3]
res = pd.concat(frames)
res.shape

(10, 3)

In [7]:
res

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6
7  7  7  7
8  8  8  8
9  9  9  9

In [8]:
# Getting hierarchical index
res1 = pd.concat(frames,keys=['a','b','c'])
res1

     A  B  C
a 0  0  0  0
  1  1  1  1
  2  2  2  2
b 3  3  3  3
  4  4  4  4
  5  5  5  5
  6  6  6  6
c 7  7  7  7
  8  8  8  8
  9  9  9  9

In [9]:
res1.loc['c']

   A  B  C
7  7  7  7
8  8  8  8
9  9  9  9

In this example, we take two DataFrames with similar indexes and concatenate them using the concat() function.

In [10]:
df4 = pd.DataFrame({'E':[1,2,3,5], 'F':[1,2,3,5]}, index=[1,2,3,5])
df4

   E  F
1  1  1
2  2  2
3  3  3
5  5  5

In [11]:
res2 = pd.concat([df1,df4], axis=1)
res2

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  1.0  1.0
2  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

In [12]:
res2.reset_index()

   index    A    B    C    E    F
0      0  0.0  0.0  0.0  NaN  NaN
1      1  1.0  1.0  1.0  1.0  1.0
2      2  2.0  2.0  2.0  2.0  2.0
3      3  NaN  NaN  NaN  3.0  3.0
4      5  NaN  NaN  NaN  5.0  5.0

The next examples shows how to execute something equivalent to an INNER JOIN between two tables of a database. In this case, it will involve two DataFrames.
`join = 'inner'` produces the next result:

In [13]:
res3 = pd.concat([df1,df4], axis=1, join='inner')
res3

   A  B  C  E  F
1  1  1  1  1  1
2  2  2  2  2  2

You only get the rows belonging to both DataFrames.

If you do not specify `join = 'inner'`, you get a bigger DataFrame (equivalent to a SQL CROSS JOIN). Notice that missing values are filled with NaN.

In [14]:
res4 = pd.concat([df1,df4])
res4

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
1  NaN  NaN  NaN  1.0  1.0
2  NaN  NaN  NaN  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

Concatenating using append

In this example you will concatenate two DataFrames with the same columns using the `append()` function.

In [15]:
display(df1)
display(df2)
df1.append(df2)

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2

   A  B  C
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6

In [16]:
df2.append(df1)

   A  B  C
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6
0  0  0  0
1  1  1  1
2  2  2  2

You can concatenate more than two DataFrames:

In [17]:
df1.append([df2,df3])

   A  B  C
0  0  0  0
1  1  1  1
2  2  2  2
3  3  3  3
4  4  4  4
5  5  5  5
6  6  6  6
7  7  7  7
8  8  8  8
9  9  9  9

In [18]:
# Ignoring indexes on the concatenation axis
res4 = pd.concat([df1,df4], ignore_index=True)
res4

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
3  NaN  NaN  NaN  1.0  1.0
4  NaN  NaN  NaN  2.0  2.0
5  NaN  NaN  NaN  3.0  3.0
6  NaN  NaN  NaN  5.0  5.0

In [19]:
# another way
res5 = df1.append(df4, ignore_index=True)
res5

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  NaN  NaN
2  2.0  2.0  2.0  NaN  NaN
3  NaN  NaN  NaN  1.0  1.0
4  NaN  NaN  NaN  2.0  2.0
5  NaN  NaN  NaN  3.0  3.0
6  NaN  NaN  NaN  5.0  5.0

In [20]:
res6 = pd.concat([df1,df4], axis=1)
res6

     A    B    C    E    F
0  0.0  0.0  0.0  NaN  NaN
1  1.0  1.0  1.0  1.0  1.0
2  2.0  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  3.0  3.0
5  NaN  NaN  NaN  5.0  5.0

## Merge

The different types of join or merge in Pandas:
- `Inner Join`: To keep only rows that match from the DataFrames, specify how=‘inner’.
- `Outer Join` or Full outer join: To keep all rows from both data frames, specify how=‘outer’.
- `Left Join` or Left outer join: To include all the rows of your data frame x and only those from y that match, specify how=‘left’.
- `Right Join` or Right outer join: To include all the rows of your data frame y and only those from x that match, specify how=‘right’.

![image info](./Merge.png)

In [21]:
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
      'Product':pd.Series(['Radio','Radio','Radio','Television','Television','Television'])}
df1 = pd.DataFrame(d1)
df1

   Customer_id     Product
0            1       Radio
1            2       Radio
2            3       Radio
3            4  Television
4            5  Television
5            6  Television

In [22]:
d2 = {'Customer_id':pd.Series([2,4,6,8,10]),
    'State':pd.Series(['Nevada','Nevada','Texas','Florida','Florida'])}
df2 = pd.DataFrame(d2)
df2

   Customer_id    State
0            2   Nevada
1            4   Nevada
2            6    Texas
3            8  Florida
4           10  Florida

In [23]:
#inner join 
display(pd.merge(df1, df2, on='Customer_id', how='inner'))

   Customer_id     Product   State
0            2       Radio  Nevada
1            4  Television  Nevada
2            6  Television   Texas

In [24]:
# outer join 
display(pd.merge(df1, df2, on='Customer_id', how='outer'))

   Customer_id     Product    State
0            1       Radio      NaN
1            2       Radio   Nevada
2            3       Radio      NaN
3            4  Television   Nevada
4            5  Television      NaN
5            6  Television    Texas
6            8         NaN  Florida
7           10         NaN  Florida

In [25]:
# left join 
display(pd.merge(df1, df2, on='Customer_id', how='left'))

   Customer_id     Product   State
0            1       Radio     NaN
1            2       Radio  Nevada
2            3       Radio     NaN
3            4  Television  Nevada
4            5  Television     NaN
5            6  Television   Texas

In [26]:
# right join 
display(pd.merge(df1, df2, on='Customer_id', how='right'))

   Customer_id     Product    State
0            2       Radio   Nevada
1            4  Television   Nevada
2            6  Television    Texas
3            8         NaN  Florida
4           10         NaN  Florida

## Join

`DataFrame.join()` is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [27]:
left = pd.DataFrame({'Col_A':['A0','A1','A2'],'Col_B':['B0','B1','B2']},index=['a','b','c'])
left

  Col_A Col_B
a    A0    B0
b    A1    B1
c    A2    B2

In [28]:
right = pd.DataFrame({'Col_C':['C0','C1','C2'],'Col_D':['D0','D1','D2']},index=['a','c','d'])
right

  Col_C Col_D
a    C0    D0
c    C1    D1
d    C2    D2

In [29]:
left.join(right)

  Col_A Col_B Col_C Col_D
a    A0    B0    C0    D0
b    A1    B1   NaN   NaN
c    A2    B2    C1    D1

In [30]:
right.join(left)

  Col_C Col_D Col_A Col_B
a    C0    D0    A0    B0
c    C1    D1    A2    B2
d    C2    D2   NaN   NaN

In [31]:
left.join(right, how='inner')

  Col_A Col_B Col_C Col_D
a    A0    B0    C0    D0
c    A2    B2    C1    D1

In [32]:
right.join(left, how='inner')

  Col_C Col_D Col_A Col_B
a    C0    D0    A0    B0
c    C1    D1    A2    B2